app/views/clans/_form.html.erb

SELECT "dragons".* FROM "dragons"   ORDER BY "dragons"."name" ASC
---
    <%= f.label :dragon_id %><br>
    <%= f.collection_select :dragon_id, Dragon.order(:name),:id,:name, include_blank: true %>