app/controllers/clans_controller.rb

  def index
    @clans = Clan.all
---
SELECT "clans".* FROM "clans"

  def create
    @clan = Clan.new(clan_params)

    respond_to do |format|
      if @clan.save
---
INSERT INTO "clans" ("created_at", "dragon_id", "name", "species", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-06-06 23:27:35.360439"], ["dragon_id", 2], ["name", "Tracker"], ["species", "Wyvern"], ["updated_at", "2016-06-06 23:27:35.360439"]]

  def update
    respond_to do |format|
      if @clan.update(clan_params)
---
UPDATE "clans" SET "species" = ?, "updated_at" = ? WHERE "clans"."id" = 2  [["species", "Fireworm"], ["updated_at", "2016-06-07 19:17:29.210256"]]

    def set_clan
      @clan = Clan.find(params[:id])
---
SELECT  "clans".* FROM "clans"  WHERE "clans"."id" = ? LIMIT 1  [["id", 2]]