app/controllers/dragons_controller.rb

  def index
    @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

  def create
    @dragon = Dragon.new(dragon_params)

    respond_to do |format|
      if @dragon.save
---
INSERT INTO "dragons" ("created_at", "gender", "name", "race", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-05-17 20:24:51.535710"], ["gender", "teste"], ["name", "teste"], ["race", "teste"], ["updated_at", "2016-05-17 20:24:51.535710"]]

  def update
    respond_to do |format|
      if @dragon.update(dragon_params)
---
UPDATE "dragons" SET "gender" = ?, "name" = ?, "race" = ?, "updated_at" = ? WHERE "dragons"."id" = 2  [["gender", "Female"], ["name", "Tempestade"], ["race", "Deadly Nadder"], ["updated_at", "2016-06-06 23:22:03.130461"]]

  def destroy
    @dragon.destroy
---
DELETE FROM "dragons" WHERE "dragons"."id" = ?  [["id", 1]]

    def set_dragon
      @dragon = Dragon.find(params[:id])
---
SELECT  "dragons".* FROM "dragons"  WHERE "dragons"."id" = ? LIMIT 1  [["id", 2]]