app/controllers/elements_controller.rb

  def index
    @elements = Element.all
---
SELECT "elements".* FROM "elements"

  def create
    @element = Element.new(element_params)

    respond_to do |format|
      if @element.save
---
INSERT INTO "elements" ("created_at", "dragon_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-06-06 22:29:07.969503"], ["dragon_id", 3], ["name", "Fire"], ["updated_at", "2016-06-06 22:29:07.969503"]]

    def set_element
      @element = Element.find(params[:id])
---
SELECT  "elements".* FROM "elements"  WHERE "elements"."id" = ? LIMIT 1  [["id", 2]]