app/controllers/strokes_controller.rb

  def index
    @strokes = Stroke.all
---
SELECT "strokes".* FROM "strokes"

  def create
    @stroke = Stroke.new(stroke_params)

    respond_to do |format|
      if @stroke.save
---
INSERT INTO "strokes" ("created_at", "dragon_id", "kind", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-06-06 23:30:11.732132"], ["dragon_id", 2], ["kind", "Attack"], ["name", "Spine Shot"], ["updated_at", "2016-06-06 23:30:11.732132"]]

    def set_stroke
      @stroke = Stroke.find(params[:id])
---
SELECT  "strokes".* FROM "strokes"  WHERE "strokes"."id" = ? LIMIT 1  [["id", 1]]