app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "user_type", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user
      @user = User.find(params[:id])