app/views/strokes/_form.html.erb

    <%= f.label :dragon_id %><br>
    <%= f.collection_select :dragon_id, Dragon.order(:name),:id,:name, include_blank: true %>
---
SELECT "dragons".* FROM "dragons"   ORDER BY "dragons"."name" ASC